[{"title":{"S":"G-III to Acquire Sonia Rykiel"},"dt":{"N":"1632787200000"},"updatedAt":{"S":"Tue Sep 28 2021"},"country":{"S":"United States"},"region":{"S":"North America"},"industry":{"S":"apparel"},"topic":{"SS":["defunct","portfolio"]},"Year":{"N":"2021"},"content":{"S":"G-III Apparel Group revealed that it has entered into an agreement to purchase Sonia Rykiel, with plans to accelerate the relaunch of the French fashion brand primarily in Europe, for the fall of 2022, with collections across multiple categories. The transaction, which comes less than two years after brothers Eric and Michael Dayan successfully bid to acquire all of the bankrupt brand’s assets via a court-administered process. (Those assets included the brand’s intellectual property rights (namely, its various global trademark registrations, and decades of archives and product prototypes); the commercial leases for its brick-and-mortar outposts in France – from its Saint Germain flagship to a glitzy boutique in Cannes, among others; and its remaining stock of garments and accessories.)The deal is expected to close by the end of October 2021."}},{"title":{"S":"Chanel Takes Majority Stake in Paima"},"dt":{"N":"1629763200000"},"updatedAt":{"S":"Tue Aug 24 2021"},"country":{"S":"France"},"region":{"S":"Europe"},"industry":{"S":"apparel"},"topic":{"SS":["supply chain","knitwear","luxury"]},"Year":{"N":"2021"},"content":{"S":"Chanel has taken a majority stake in Italian knitwear company Paima, a move that falls in line with a larger pattern of luxury giants looking gain greater control over their supply chains by bringing key third-party companies under their own roofs. “This decision has been motivated by converging interests,” Chanel asserted in a statement, noting that while Paima, which has been a supplier for the French fashion brand for 25 years, “has seen its development accelerate in recent years, it seemed appropriate to have a solid partner to help it grow [further] and invest.” More than that, Chanel revealed that the investment “provides a more sustainable collaboration framework by continuing an already established relationship.”"}},{"title":{"S":"Authentic Brands Group Buys Reebok"},"dt":{"N":"1628726400000"},"updatedAt":{"S":"Thu Aug 12 2021"},"country":{"S":"Germany"},"region":{"S":"Europe"},"industry":{"S":"footwear"},"topic":{"SS":["portfolio"]},"Year":{"N":"2021"},"content":{"S":"Adidas is selling its Reebok brand to Authentic Brands Groups for up to 2.1 billion euros ($2.46 billion), with the German sporting wear group looking to “focus on its core brand after the U.S. fitness label failed to live up to expectations,” per Reuters. Authentic Brand, which filed its preliminary IPO documentation in July, has been on a buying streak in the past few years, with the brand developer buying up an array of fashion and apparel companies, ranging from Juicy Couture and Judith Leiber to Jones New York, Volcom, and Aeropostale."}},{"title":{"S":"Aeffe Takes Full Control of Moschino"},"dt":{"N":"1627430400000"},"updatedAt":{"S":"Wed Jul 28 2021"},"country":{"S":"Italy"},"region":{"S":"Europe"},"industry":{"S":"apparel"},"topic":{"SS":["luxury","portfolio"]},"Year":{"N":"2021"},"content":{"S":"Italian fashion and luxury goods group Aeffe S.p.A. has acquired the remaining 30 percent of Moschino in exchange for 66.6 million euros ($78.51 million), bringing its holding of the company to 100 percent and the valuation of the Jeremy Scott-designed brand to $261.7 million. Aeffe also owns Alberta Ferretti, Philosophy by Lorenzo Serafini and Pollini.In a statement, Aeffe Executive Chairman Massimo Ferretti said, “The operation we have just concluded has long been considered an important step in our medium-long term growth strategy. With the full control over MOSCHINO brand, we are now in the best conditions to manage all activities related to the brand’s value chain, from product to quality and with positive effects on image, distribution and communication.”"}},{"title":{"S":"LVMH Takes Majority Stake in Off-White"},"dt":{"N":"1626739200000"},"updatedAt":{"S":"Tue Jul 20 2021"},"country":{"S":"France"},"region":{"S":"Europe"},"industry":{"S":"streetwear"},"topic":{"SS":["LVMH"]},"Year":{"N":"2021"},"content":{"S":"LVMH announced on Tuesday that it is taking a majority stake in Off-White, the upscale streetwear brand that Virgil Abloh launched in 2013. In a statement, LVMH revealed that in addition to taking a 60 percent stake in Off-White, it has entered into a new “arrangement” with Abloh to “jointly pursue new projects across luxury categories.”"}},{"title":{"S":"L Catterton Takes Majority Stake in Etro"},"dt":{"N":"1626566400000"},"updatedAt":{"S":"Sun Jul 18 2021"},"country":{"S":"Italy"},"region":{"S":"Europe"},"industry":{"S":"apparel"},"topic":{"SS":["LVMH"]},"Year":{"N":"2021"},"content":{"S":"Etro announced on July 18 that it entered into a binding agreement to partner with L Catterton. Under the terms of the agreement, LVMH-affiliated L Catterton Europe will acquire a majority stake in Etro, while the Etro family will retain a significant minority. Etro Founder Gerolamo Etro will be appointed as Chairman of the company."}},{"title":{"S":"LVMH Takes Minority Stake in Phoebe Philo"},"dt":{"N":"1626048000000"},"updatedAt":{"S":"Mon Jul 12 2021"},"country":{"S":"France"},"region":{"S":"Europe"},"industry":{"S":"luxury"},"topic":{"SS":["LVMH"]},"Year":{"N":"2021"},"content":{"S":"Phoebe Philo announced that she is launching her own label after spending three and a half years out of the spotlight following her 10-year tenure with Celine, and revealed that LVMH has taken a minority stake in her soon-to-launch label. The size of LVMH’s minority position and the terms of the deal have not been disclosed."}},{"title":{"S":"Nordstrom Takes Stake in Four ASOS Brands"},"dt":{"N":"1625961600000"},"updatedAt":{"S":"Sun Jul 11 2021"},"country":{"S":"United Kingdom"},"region":{"S":"Europe"},"industry":{"S":"fast fashion"},"topic":{"SS":["department store"]},"Year":{"N":"2021"},"content":{"S":"Nordstrom announced that it has acquired a minority stake in four apparel brands owned by British fashion group ASOS. Topshop, Topman, Miss Selfridge and the activewear label HIIT, which ASOS acquired from Arcadia Group for £295 million($407.21 million) in February 2021, will enable the U.S. department store chain to target millennial and Gen-Z consumers. Financial terms of the deal have not been disclosed. “Bringing the ASOS brands to our customers allows us to create newness and excitement,” Pete Nordstrom said in a statement on Sunday, noting that Nordstrom has been the exclusive U.S. distributer of the Topshop and Topman brands since 2012."}},{"title":{"S":"Glossier Raises $80 Million in Latest Round"},"dt":{"N":"1625616000000"},"updatedAt":{"S":"Wed Jul 07 2021"},"country":{"S":"United States"},"region":{"S":"North America"},"industry":{"S":"beauty"},"topic":{"SS":["DTC"]},"Year":{"N":"2021"},"content":{"S":"Glossier announced that it has raised $80 million in Series E funding. The round, which was led by Lone Pine Capital with participation from existing investors Forerunner Ventures, Index Ventures, IVP, Sequoia Capital, and Thrive Capital, values the millennial-focused beauty company at $1.8 billion."}},{"title":{"S":"Richemont Acquires Delvaux"},"dt":{"N":"1625011200000"},"updatedAt":{"S":"Wed Jun 30 2021"},"country":{"S":"Belgian"},"region":{"S":"Europe"},"industry":{"S":"luxury"},"topic":{"SS":["handbags","Richemont"]},"Year":{"N":"2021"},"content":{"S":"Cartier owner Richemont announced on Wednesday that it has acquired a 100 percent stake in Belgian luxury leather goods brand Delvaux in “a private transaction.” Founded in 1829, Richemont says that Delvaux is the oldest luxury leather goods Maison in the world. The Swiss conglomerate revealed that the transaction has “no material financial impact on [its] consolidated net assets or operating result for the year ending March 31, 2022,” and that Delvaux’s revenues will be reported within its Other” business area. The acquisition appears to be a sign that Richemont is looking to bolster its softer luxury offerings, having built its name in the hard luxury (i.e., jewelry and watches) segment of the market."}},{"title":{"S":"Kering Takes Stake in Luxury Rental Co. Cocoon"},"dt":{"N":"1624492800000"},"updatedAt":{"S":"Thu Jun 24 2021"},"country":{"S":"United Kingdom"},"region":{"S":"Europe"},"industry":{"S":"rental"},"topic":{"SS":["handbag","Kering"]},"Year":{"N":"2021"},"content":{"S":"Kering has taken an undisclosed stake in a luxury rental company. In a statement on Thursday, Kering announced that it has invested in Cocoon, a London-based startup that specializes in facilitating rentals for luxury handbags – including offerings from upwards of 30 brands, such as Kering-owned Gucci, Balenciaga, and Bottega Veneta – with the investment coming as part of a larger $3.5 million round that also included participation from resale platform Depop’s founder Simon Beckerman, among others. Kering’s chief client and digital officer Gregory Boutte said the deal is part of a larger strategy by the conglomerate to invest in innovative young companies."}},{"title":{"S":"GOAT Nabs $3.7 Billion Valuation with New Round"},"dt":{"N":"1624492800000"},"updatedAt":{"S":"Thu Jun 24 2021"},"country":{"S":"United States"},"region":{"S":"North America"},"industry":{"S":"streetwear"},"topic":{"SS":["marketplace","sneakers"]},"Year":{"N":"2021"},"content":{"S":"Online sneaker and apparel marketplace GOAT Group has raised $195 million in a new funding round, which has “more than doubled its valuation to $3.7 billion,” per Reuters. The Los Angeles-based company, which was founded in 2015, boasts some 30 million customers across 170 countries, and “posted gross merchandise value, which represents the total volume of goods sold, of $2 billion over the past year as sales of sneakers and apparel surged.”The buzzy platform made headlines early this year when it announced that it had welcomed a “strategic investment” from Groupe Artemis – the controlling shareholder of Gucci, Balenciaga, Saint Laurent, and Bottega Veneta’s parent company Kering – as it “continues its expansion in fashion apparel and new categories.” (It also garnered attention in connection with a settlement in the trademark lawsuit filed against it by London-based brand Goat Fashion.)"}},{"title":{"S":"Prada, Zegna Take Stakes in Cashmere Supplier"},"dt":{"N":"1624320000000"},"updatedAt":{"S":"Tue Jun 22 2021"},"country":{"S":"Italy"},"region":{"S":"Europe"},"industry":{"S":"apparel"},"topic":{"SS":["supply chain","luxury"]},"Year":{"N":"2021"},"content":{"S":"Prada has partnered with fellow Italian fashion company Ermenegildo Zegna Group to acquire a controlling stake in Italian cashmere producer Filati Biagioli Modesto in furtherance of a quest to “secure a domestic supply chain and luxury-goods manufacturing expertise.” The two big-name fashion entities will each take a 40 percent stake in the Montale-based supplier, which is known for its Italian cashmere and “noble yarns,” while the Biagioli family will hold on to 15 percent of the company, and newly-appointed CEO Renato Cotto – who recently served as a director at LVMH’s Loro Piana – will assume a 5 percent holding."}},{"title":{"S":"LVMH Takes Full Control of Pucci"},"dt":{"N":"1623974400000"},"updatedAt":{"S":"Fri Jun 18 2021"},"country":{"S":"Italy"},"region":{"S":"Europe"},"industry":{"S":"luxury"},"topic":{"SS":["LVMH","apparel"]},"Year":{"N":"2021"},"content":{"S":"LVMH Moët Hennessy Louis Vuitton acquired the outstanding 33 percent stake in Emilio Pucci just over two decades after it paid an undisclosed sum for a 67 percent ownership stake in the Italian fashion house in 2000. In a statement on Friday, as first reported by WWD, Toni Belloni, LVMH’s group managing director thanked the Pucci family, and in particular, Laudomia Pucci, the daughter of founder Emilio Pucci, who has served as the Deputy Chairman and Image Director of the brand, “for their friendship and collaboration over the years.” In conjunction with the deal, Ms. Pucci will step down from her current role and “dedicate herself to the archives and promoting the heritage of her late father.”"}},{"title":{"S":"Fosun Fashion Group Announces Sergio Rossi Acquisition"},"dt":{"N":"1623283200000"},"updatedAt":{"S":"Thu Jun 10 2021"},"country":{"S":"China"},"region":{"S":"Asia"},"industry":{"S":"footwear"},"topic":{"SS":["portfolio"]},"Year":{"N":"2021"},"content":{"S":"In a statement on June 10, Fosun Fashion Group revealed that it has signed an agreement to acquire 100 percent of Sergio Rossi S.p.A from from Absolute Luxury Holding S.r.l., an independently-managed investment subsidiary of Investindustrial V L.P., for an undisclosed sum. The Shanghai-headquartered group stated that the acquisition will “further enrich FFG’s luxury brand portfolio, which currently includes Lanvin, Wolford, Caruso and St. John Knits, complementing the group’s core competency through luxury accessories.”"}},{"title":{"S":"Sequoia Takes Stake in SSENSE"},"dt":{"N":"1624147200000"},"updatedAt":{"S":"Sun Jun 20 2021"},"country":{"S":"China"},"region":{"S":"Asia"},"industry":{"S":"streetwear"},"topic":{"SS":["marketplace"]},"Year":{"N":"2021"},"content":{"S":"SSENSE announced that it has sold an undisclosed stake in the company to California-based venture capital firm Sequoia Capital in a deal that values the Montreal-headquartered e-commerce retailer at 5 billion CAD ($4.13 billion). As for what the investment might entail, it appears that the high fashion-focused retailer has set its sights on expansion in China, as Angelica Cheung, the former editor-in-chief of Vogue China, who joined Sequoia Capital China as a venture partner in February, will join the SEENSE’s board in connection with the deal."}},{"title":{"S":"LVMH Boosts Stake in Tod’s"},"dt":{"N":"1619049600000"},"updatedAt":{"S":"Thu Apr 22 2021"},"country":{"S":"Italy"},"region":{"S":"Europe"},"industry":{"S":"luxury"},"topic":{"SS":["LVMH","handbag"]},"Year":{"N":"2021"},"content":{"S":"Tod’s revealed that LVMH will boost its exist stake in Tod’s to 10 percent by way of a new 6.8 percent increase. “A source close to the matter said the French giant does not expect to raise its stake further for now,” Reuters reported, noting that Tod’s founder and chairman Diego Della Valle has been a member of LVMH’s board of directors since 2002. While Della Valle has repeatedly denied longstanding chatter about a takeover, he stated on Thursday that “this may represent an excellent reason to consider further opportunities to be taken in the future ahead,” referring to LVMH’s stake increase."}},{"title":{"S":"Ferrari owner Exor takes 24% stake in Louboutin"},"dt":{"N":"1615161600000"},"updatedAt":{"S":"Mon Mar 08 2021"},"country":{"S":"France"},"region":{"S":"Europe"},"industry":{"S":"footwear"},"topic":{"SS":["portfolio"]},"Year":{"N":"2021"},"content":{"S":"Exor Group – the $30 billion Netherlands-incorporated investment group run by the Italian Agnelli family and the largest shareholder in Italian automaker Ferrari – announced that it will take a 24 percent stake in the independently-owned Louboutin in exchange for 541 million euros ($640 million), a deal that values the 30-year old Paris-based footwear brand at $2.3 billion euros ($2.73 billion) and sets it up for expansion, particularly in China."}},{"title":{"S":"Margiela-owner OTB acquires Jil Sander"},"dt":{"N":"1614902400000"},"updatedAt":{"S":"Fri Mar 05 2021"},"country":{"S":"Italy"},"region":{"S":"Europe"},"industry":{"S":"apparel"},"topic":{"SS":["portfolio"]},"Year":{"N":"2021"},"content":{"S":"Japanese apparel group Onward Holdings announced that it will sell the Jil Sander brand to Renzo Rosso’s luxury group, OTB, the parent of Diesel, Maison Margiela, Marni, Amiri, and Viktor & Rolf. The financial figures associated with that deal remain undisclosed."}},{"title":{"S":"Kering leads $216 million Vesitaire round"},"dt":{"N":"1614556800000"},"updatedAt":{"S":"Mon Mar 01 2021"},"country":{"S":"France"},"region":{"S":"Europe"},"industry":{"S":"resale"},"topic":{"SS":["Kering"]},"Year":{"N":"2021"},"content":{"S":"Kering and American investment firm Tiger Global Management are leading a new funding round that sees secondhand marketplace Vestiaire Collective bring in $216 million in new funding, along with existing investors, including its CEO Max Bittner, Vogue’s parent company Condé Nast, and the Eurazeo Group, among others. The deal gives Paris-based Vestiaire “unicorn status” – i.e., puts a $1 billion-plus value on the privately-held company – and “ideally positions it for its next cycle of accelerated growth.”"}},{"title":{"S":"Exor Group acquires Shang Xia"},"dt":{"N":"1607472000000"},"updatedAt":{"S":"Wed Dec 09 2020"},"country":{"S":"China"},"region":{"S":"Asia"},"industry":{"S":"luxury"},"topic":{"SS":["portfolio"]},"Year":{"N":"2020"},"content":{"S":"Ferrari owner Exor Group announced that it will invest “around €80 million [$96.9 million] in Shang Xia via a reserved capital increase that will result in it becoming the company’s majority shareholder.” Exor noted that Hermès – which “has accompanied Shang Xia successfully throughout the initial phase of its development – will remain as an important shareholder alongside Exor and [founder] Jiang Qiong Er.”"}},{"title":{"S":"Moncler acquires Stone Island"},"dt":{"N":"1607299200000"},"updatedAt":{"S":"Mon Dec 07 2020"},"country":{"S":"Italy"},"region":{"S":"Europe"},"industry":{"S":"luxury"},"topic":{"SS":["outerwear"]},"Year":{"N":"2020"},"content":{"S":"Moncler announced that it will acquire Italian fashion label Stone Island for $1.4 billion. Bloomberg reported that the Milan-headquartered luxury outerwear company will “purchase 70 percent of Stone Island’s parent company SPW from Chief Executive Officer Carlo Rivetti and other members of his family, [and] then buy the remaining 30 percent from Singapore’s state investor Temasek” in furtherance of a two-step transaction."}},{"title":{"S":"VF Corp. acquires Supreme for $2.1 billion"},"dt":{"N":"1604880000000"},"updatedAt":{"S":"Mon Nov 09 2020"},"country":{"S":"United States"},"region":{"S":"North America"},"industry":{"S":"streetwear"},"topic":{"SS":["portfolio"]},"Year":{"N":"2020"},"content":{"S":"Three years after Supreme sold off a reported 50 percent stake to private equity giant Carlyle Group, VF Corp revealed that it will pay $2.1 billion to buy popular streetwear brand. The deal – which was formally completed on December 28, 2020 – saw VF Corp. take full ownership of Supreme, with current Supreme investors Carlyle Group and New York-based private equity firm Goode Partners agreeing to sell their stakes in the New York-based brand."}},{"title":{"S":"Alibaba, Richemont invest $1.1 billion in Farfetch"},"dt":{"N":"1604534400000"},"updatedAt":{"S":"Thu Nov 05 2020"},"country":{"S":"China"},"region":{"S":"Asia"},"industry":{"S":"luxury"},"topic":{"SS":["marketplace","Alibaba","Richemont"]},"Year":{"N":"2020"},"content":{"S":"Alibaba Group Holding and Richemont announced that they will invest $1.1 billion in online luxury fashion retailer Farfetch and its new marketplace in China. At the same time, Artemis – an investment vehicle tied to Gucci owner Kering – simultaneously announced that it would increase its stake in Farfetch with a $50 million injection of cash in exchange for Farfetch’s Class A ordinary shares."}},{"title":{"S":"LVMH and Tiffany & Co. agree to $15.8 billion merger"},"dt":{"N":"1603929600000"},"updatedAt":{"S":"Thu Oct 29 2020"},"country":{"S":"United States"},"region":{"S":"North America"},"industry":{"S":"luxury"},"topic":{"SS":["LVMH"]},"Year":{"N":"2020"},"content":{"S":"LVMH Moët Hennessy Louis Vuitton and Tiffany & Co. managed to salvage their meger deal, with the French luxury goods conglomerate agreeing to pay a few dollars less per share to acquire the New York-based jewelry company. In a statement, the parties confirmed that LVMH will pay $131.5 per Tiffany share, down from the $135/share price tag they initially agreed to in November 2019 before the onset of the COVID-19 pandemic."}}]